Tekla Open API Reference for Tekla Structures 2025
DrawingEnumeratorBase.SelectInstances Field
 Indicates that the instance Select() is called when the 'Current' item is asked from the enumerator. The user can set this to 'false' if no members are ever asked from the instance. This is the case when, for example, asking only a report property from the identifier. Warning: normally the user should not change this value.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool SelectInstances
Public SelectInstances As Boolean
Field Value
Type: Boolean
See Also
Reference
DrawingEnumeratorBase Class
Tekla.Structures.Drawing Namespace